# **Tujuan utama adalah membuat web sederhana untuk membantu melakukan analisis awal data sebelum dilakukan pemerosesan data pada model machine learning melalui visual data**

In [1]:
import pandas as pd
df=pd.read_csv('penguins_size.csv')

In [2]:
df.head()

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE

In [3]:
df.isnull().sum()

species               0
island                0
culmen_length_mm      2
culmen_depth_mm       2
flipper_length_mm     2
body_mass_g           2
sex                  10
dtype: int64

In [4]:
(len(df)-18)/len(df)

0.9476744186046512

In [5]:
df=df.dropna()

In [6]:
df_nums=df.select_dtypes(include=[int,float])
df_nums

     culmen_length_mm  culmen_depth_mm  flipper_length_mm  body_mass_g
0                39.1             18.7              181.0       3750.0
1                39.5             17.4              186.0       3800.0
2                40.3             18.0              195.0       3250.0
4                36.7             19.3              193.0       3450.0
5                39.3             20.6              190.0       3650.0
..                ...              ...                ...          ...
338              47.2             13.7              214.0       4925.0
340              46.8             14.3              215.0       4850.0
341              50.4             15.7              222.0       5750.0
342              45.2             14.8              212.0       5200.0
343              49.9             16.1              213.0       5400.0

[334 rows x 4 columns]

In [7]:
df_objs=df.select_dtypes(include=['object', 'category'])
df_objs

    species     island     sex
0    Adelie  Torgersen    MALE
1    Adelie  Torgersen  FEMALE
2    Adelie  Torgersen  FEMALE
4    Adelie  Torgersen  FEMALE
5    Adelie  Torgersen    MALE
..      ...        ...     ...
338  Gentoo     Biscoe  FEMALE
340  Gentoo     Biscoe  FEMALE
341  Gentoo     Biscoe    MALE
342  Gentoo     Biscoe  FEMALE
343  Gentoo     Biscoe    MALE

[334 rows x 3 columns]

In [8]:
df_objs['sex'].unique()

array(['MALE', 'FEMALE', '.'], dtype=object)

In [ ]:
df_nums.columns

In [ ]:
df_objs.columns

In [9]:
import streamlit as st
import pandas as pd
import plotly.express as px
from statsmodels.graphics.gofplots import qqplot
import plotly.graph_objects as go
from streamlit_extras.metric_cards import style_metric_cards
import plotly.graph_objs as go

# Memeriksa versi Streamlit
st.write("Versi Streamlit:", st.__version__)

# Memeriksa versi Pandas
st.write("Versi Pandas:", pd.__version__)

# Memeriksa versi Plotly Express
st.write("Versi Plotly Express:", px.__version__)

# Memeriksa versi Statsmodels
st.write("Versi Statsmodels:", statsmodels.__version__)

# Memeriksa versi Plotly Graph Objects
st.write("Versi Plotly Graph Objects:", go.__version__)

# Memeriksa versi Streamlit Extras
st.write("Versi Streamlit Extras:", streamlit_extras.__version__)

2024-06-12 00:29:35.858
  Warning: to view this Streamlit app on a browser, run it with the following
  command:

    streamlit run C:\Users\ACER\anaconda3\lib\site-packages\ipykernel_launcher.py [ARGUMENTS]

AttributeError: module 'plotly.express' has no attribute '__version__'